{"data":{"markdownRemark":{"html":"<p>Over the last three years, I have labored to help a legacy organization transform their processes into a digital world.  The legacy organization I have worked with is the U.S. Small Business Administration, originally founded in 1953.  For this essay, I define a legacy organization as being older than 25 years (existing before the dawn of the internet, the digital era), still having business processes that were designed for that time, and staffing a workforce that holds dated attitudes and views.</p>\n<h1>Digital Transformation</h1>\n<p>Digital transformation focuses on reimagining business processes for the modern era.  This type of transformation is difficult, because even though it seems mostly focused on technology, it actually impacts people and process more.  I have learned a lot of hard lessons over the last three years, and I have been privileged to observe what works and what does not.  In this essay, I will outline for you the seven key ingredients I believe are needed to change a legacy organization.</p>\n<h1>7 Ingredients for Change</h1>\n<p>Every great soup combines very different ingredients, from vegetables to meat, cheese, and spices, all to produce an orchestrated, delicious and nuanced meal.  Digital transformation is the same way in that you have to combine a bunch of different ingredients, key people and new ways of thinking, in order to really change an organization.</p>\n<h2>Executive Sonsorship (Garlic)</h2>\n<p>Every great soup starts with a base ingredient, and for digital transformation, that base ingredient should be executive will or executive sponsorship.  Large legacy organizations are more complex, because they have endured years of entropy.  For organizations that are businesses, entropy normally occures as a result of internal politics, reorganizations, shifting priorities, and varied leadership over time.</p>\n<p>In a normal business organization, entropy is culled and kept in check by the business' need to produce a profit.  In a government agency, normal organizational entropy is magnified, because there's no need to be profitable and therefore no dampening effect from the pure need to survive.this is reorganLarge organizations are complex</p>\n<h2>A Common Language (Onions)</h2>\n<h2>Versatile Team (Potatoes)</h2>\n<h2>Modern Procurement (Broccoli)</h2>\n<h2>Agile Methods (Cheese)</h2>\n<h2>Right Technology (Lemon Juice)</h2>\n<h2>Change Management (Bread)</h2>","timeToRead":1,"frontmatter":{"title":"Digital Transformation: 7 Ingredients for Change","date":"January 31, 2019","tags":["rainmaker"]}}},"pageContext":{"slug":"/2019/01/31-7-ingredients-for-digital-transformation/","prev":"/2019/01/18-power-over-distraction/","next":null}}