{"data":{"markdownRemark":{"html":"<p>I have been hard at work for the last few months, updating myself on the brave new world of web development in 2018.  This process of shaking off the rust, of shedding my dinosaur like skin from yonder years, has been tough.</p>\n<p>There's a lot to learn.  There's even more to remember.</p>\n<p>That's why I'm taking a break to explain a little bit about a technique I'm employing called spaced repetition.  Spaced repetition is essentially the idea that your memory retention increases if you're required to recall certain knowledge at spaced out intervals of time.  A lot of people learn new vocabulary through using flashcards this way, going back to review the flash cards over periods of time.  </p>\n<p>Each subsequent action requires your brain to re-trench that neural pathway, thus making it stronger and your ability to recall it better.</p>\n<p>I think my learning over the last few months has been more effective, because I have created natural spaced repetition through the use of a markerboard or whiteboard, as well as through instituting a ritual for consuming lessons.</p>\n<p>Here's the ritual or order of operations:</p>\n<ol>\n<li>Consume lesson through listening, watching, reading</li>\n<li>Re-phrase the learnings in my own words on my markerboard or whiteboard (I draw lots of pictures or annotate code, which helps a ton!)</li>\n<li>Re-visit that concept a day, a week, maybe a few weeks later, by reading the markerboard, then turning it into a blog post here</li>\n</ol>\n<h2>Arrow Functions Example</h2>\n<p>Here's an example of how I did this with new notation I learned for JavaScript's ES2015 called arrow functions:</p>\n<h3>Lesson</h3>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions\">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions</a></p>\n<h3>Markerboard</h3>\n<p>&#x3C;&#x3C; Add picture here >></p>\n<h3>Blog Post</h3>\n<p>See my blog post from December 5th called Broke Arrows, Default Parameters to see how I re-produced this knowledge here.</p>\n<p>I highly recommend a course from Coursera called <a href=\"https://www.coursera.org/learn/learning-how-to-learn/\">Learning How to Learn</a>, which will teach fundamental skills on how to best learn and retain knowledge.</p>","timeToRead":2,"frontmatter":{"title":"Creating Natural Spaced Repetition","date":"December 21, 2018","tags":["learn"]}}},"pageContext":{"slug":"/2018/12/21-creating-natural-spaced-repetition/","prev":"/2018/12/20-javascript-going-from-cursive-to-print/","next":"/2018/12/22-love-to-hate-javascript/"}}