{"data":{"markdownRemark":{"html":"<p>For years, I have found myself using framework and library interchangeabley.  That's just wrong.  </p>\n<p>I never knew it until now, but these two are very different.  The key sits in understanding a scary sounding concept called inversion of control.  Here's the textbook definition <a href=\"https://en.wikipedia.org/wiki/Inversion_of_control\">from Wikipedia</a>:</p>\n<blockquote>\n<p>In software engineering, inversion of control (IoC) is a design principle in which custom-written portions of a computer program receive the flow of control from a generic framework. A software architecture with this design inverts control as compared to traditional procedural programming: in traditional programming, the custom code that expresses the purpose of the program calls into reusable libraries to take care of generic tasks, but with inversion of control, it is the framework that calls into the custom, or task-specific, code.</p>\n</blockquote>\n<p>Here's an easier way to understand this concept, by looking at each side-by-side:</p>\n<table>\n<thead>\n<tr>\n<th>Framework</th>\n<th>Library</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Decisions are already made for you</td>\n<td>You are in control of decisions</td>\n</tr>\n<tr>\n<td>Contains scaffolding code</td>\n<td>A collection of functionality that you call</td>\n</tr>\n<tr>\n<td>Flow of control is defined already</td>\n<td>Unopinionated means more flexible</td>\n</tr>\n</tbody>\n</table>\n<p>In short, inversion of control is like one of Yakov Smirnoff's old jokes.  Framework calls you!</p>\n<p>I would never have understood this if not for Colt Steele's formidable <a href=\"https://www.udemy.com/the-web-developer-bootcamp/\">Web Developer Bootcamp</a>.  If you're interseted in learning web development, or you're just a dinosaur like me trying to update your skills, I highly recommend checking it out.</p>","timeToRead":1,"frontmatter":{"title":"Framework vs. Library","date":"Nov 24, 2018","tags":["learn"]}}},"pageContext":{"slug":"/2018/11-24-framework-vs-library/","prev":"/2018/11-23-restful-routing-reference/","next":null}}