{"data":{"markdownRemark":{"html":"<p>Servant leadership as a term was originally coined by Robert K. Greenleaf in the 1970s.  Wikipedia defines Mr. Greenleaf's philosophy and approach to leadership as being different from traditional leadership:</p>\n<blockquote>\n<p>This (servant leadership) is different from traditional leadership where the leader's main focus is the thriving of their company or organizations. A Servant Leader shares power, puts the needs of the employees first and helps people develop and perform as highly as possible. Servant leadership inverts the norm, which puts the customer service associates as a main priority. Instead of the people working to serve the leader, the leader exists to serve the people.<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup></p>\n</blockquote>\n<p>I was originally introduced to servant leadership as a formal practice through my training as a scrum master.  Scrum masters are focused on being the sheep dogs of their team, protecting them from outside forces and distractions, so that they can focus on the work at hand.  For traditionally trained project managers, this inversion of power can feel odd at first.  For me, it felt very natural.  Becoming a scrum master, being tasked first and foremost with removing impediments for my team, I felt empowered to be a real leader.  By changing the definition of leadership, I found a more natural role for myself.</p>\n<h1>What really is a Servant Leader though?</h1>\n<h1>Real World Examples</h1>\n<h2>Borrowed vs. Leased Time</h2>\n<h2>Decision Makers vs. Decision Listeners</h2>\n<p>Queen of England and Prime Minister</p>\n<h2>My Team vs. Our Team</h2>\n<h2>Succession Planning</h2>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p><a href=\"https://en.wikipedia.org/wiki/Servant_leadership\">https://en.wikipedia.org/wiki/Servant_leadership</a></p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","timeToRead":1,"frontmatter":{"title":"What's a Servant Leader?","date":"January 01, 2019","tags":["servant-leader"]}}},"pageContext":{"slug":"/2019/01/01-whats-a-servant-leader/","prev":"/2018/12/27-a-new-language-javascript/","next":"/2019/01/07-whats-a-shortstack-developer/"}}