{"data":{"markdownRemark":{"html":"<p>Over the last three years, I have labored to help a legacy organization transform their processes into a digital world.  The legacy organization I have worked with is the U.S. Small Business Administration, originally founded in 1953.  For this essay, I define a legacy organization as being older than 25 years (existing before the dawn of the internet, the digital era), still having business processes that were designed for an earlier time, and staffing a workforce that holds similarly dated attitudes and views.</p>\n<h1>Digital Transformation</h1>\n<p>Digital transformation focuses on reimagining business processes for the modern era.  This type of transformation is difficult, because even though it seems mostly focused on technology, it actually impacts people and process more.  I have learned a lot of hard lessons over the last three years, and I have been privileged to observe what works and what does not.  In this essay, I will outline for you the seven key ingredients I believe are needed to change a legacy organization.</p>\n<h1>7 Ingredients for Change</h1>\n<p>Every great soup combines very different ingredients, from vegetables to meat, cheese, and spices, all to produce an orchestrated, delicious meal.  Digital transformation is the same: you have to combine a host of different ingredients, ranging from key people to new ways of thinking, in order to really make a fundamental change.</p>\n<h2>Executive Sonsorship (Garlic)</h2>\n<p>Every great soup starts with a base ingredient, and for digital transformation, that base ingredient should be executive will or executive sponsorship.  Great soups start with garlic.</p>\n<h3>Problem: Complexity, Gravity, Inertia</h3>\n<p>Large legacy organizations are more complex because they have endured years of entropy.  For organizations that are businesses, entropy normally occures from internal politics, reorganizations, shifting priorities, and varied leadership over time.  In a normal business organization, entropy is culled and kept in check by the business' need to produce a profit.  In a government agency, entropy grows faster, because there's no need to be profitable and therefore no dampening effect from the pure need to survive.  I think this magnifies the effects of entropy on a government organization.</p>\n<p>A side effect of this entropic process on an organziation is that different offices and departments start to accumulate gravity in asymmetric ways.  This gravity or weight means that although there's technically still a hierarchy within the organization, the shape of real power within the organization may actually manifest in cliffs and valleys.</p>\n<p>As a result of these cliffs and valleys, the big mountains, the departments in an organization that have accumulated more gravity, have more inertia.  If inertia is literally a tendency to do nothing or to remain unchanged, then I literally mean that the offices where more power and more gravity has accumulated have less inclination to make change, they have greater real inertia.</p>\n<h3>Solution: Fast, Powerful Ship</h3>\n<p>The complexity, gravity, and inertia latent in legacy organizations are the biggest hurdles to change, to transformation.  As a result, the starting point for making change in a legacy organization that has been thrown into disarray by decades of entropy has to come from <em>the top down</em>.  Grassroots efforts will be exponentially more difficult in such an environment.</p>\n<p>You need a fast and powerful ship to succeed in this kind of environment.  You need an executive sponsor.  For digital transformation, you actually need two executive sponsors.  You need one from the business side of the organization and one from within the technology part of the organization.  These are a prerequisite to starting an effort in this type of environment.</p>\n<p>Your executive sponsors are your fast and powerful ship, because they provide the ability to expedite efforts, they are your advocates for hiring proper staff, and they provide badly needed air cover for the changes that are coming.</p>\n<h3>With a Targeting Computer</h3>\n<p>Your fast and powerful ship should also have a targeting computer.  By that, I mean that at least one of your executive sponsors should have some history (at least a year) with the organization, so that they understand the intricacies that come with this kind of size.</p>\n<p>Your targeting computer will know who to introduce yo to, how interfaces should be setup between your new team and legacy teams, and where the important intersections are within the organization.</p>\n<p>Once you have two executive sponsors that can serve as your fast, powerful ships and help you target where you will start changing the organization, you can add your next ingredient.</p>\n<h2>A Common Language (Onions)</h2>\n<p>The second part of any good soup is generally onions, and in this case, it's developing a common language to use for your effort.</p>\n<h2>Versatile Team (Potatoes)</h2>\n<h2>Modern Procurement (Broccoli)</h2>\n<h2>Agile Methods (Cheese)</h2>\n<h2>Right Technology (Lemon Juice)</h2>\n<h2>Change Management (Bread)</h2>","timeToRead":3,"frontmatter":{"title":"Digital Transformation: 7 Ingredients for Change","date":"January 31, 2019","tags":["rainmaker"]}}},"pageContext":{"slug":"/2019/01/31-7-ingredients-for-digital-transformation/","prev":"/2019/01/18-power-over-distraction/","next":null}}